#include <iostream>
using namespace std;

int main() {
    int zp, fuel, taxes, repair, bank=0;//расходы
    int entered, released, passengers;//пассажиры
    
    cout << "====================================================================" << endl;

    cout << "Прибываем на остановку «Улица программистов». В салоне пассажиров: " << passengers << endl;

    
    cout << "Сколько пассажиров вышло на остановке? ";
    cin >> released;
    
    cout << "Сколько пассажиров зашло на остановке? ";
    cin >> entered;
    
    passengers += entered- released;
    bank += entered*20;

    cout << "Отправляемся с остановки «Улица программистов». В салоне пассажиров: " << passengers << endl;
    cout << "-----------Едем---------" << endl;
//----------------------------------------------------------------       
    cout << "Прибываем на остановку «Проспект алгоритмов». В салоне пассажиров: ";
    
    
        cout << "Сколько пассажиров вышло на остановке? ";
    cin >> released;
    
    cout << "Сколько пассажиров зашло на остановке? ";
    cin >> entered;
    
    passengers += entered- released;
    bank += entered*20;

    cout << "Отправляемся с остановки «Проспект алгоритмов». В салоне пассажиров: " << passengers << endl;
    cout << "-----------Едем---------" << endl;
//----------------------------------------------------------------    
    cout << "Прибываем на остановку «Улица Мира». В салоне пассажиров: ";
    
    
    cout << "Сколько пассажиров вышло на остановке? ";
    cin >> released;
    
    cout << "Сколько пассажиров зашло на остановке? ";
    cin >> entered;
    
    passengers += entered - released;
    bank += entered*20;

    cout << "Отправляемся с остановки «Улица Мира». В салоне пассажиров: " << passengers << endl;
    cout << "-----------Едем---------" << endl;
//----------------------------------------------------------------   
    cout << "Прибываем на остановку «Площадь Ленина». В салоне пассажиров: ";
    
    
    cout << "Сколько пассажиров вышло на остановке? ";
    cin >> released;
    
    cout << "Сколько пассажиров зашло на остановке? ";
    cin >> entered;
    
    passengers += entered - released;
    bank += entered*20;

    cout << "Отправляемся с остановки «Площадь Ленина». В салоне пассажиров: " << passengers << endl;
    cout << "-----------Едем---------" << endl;


    cout << "Общий зароботок составил " << bank;
}
